Ran Apply for dir: `.` workspace: `stage`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform apply -input=false \"/atlantis/repos/run0ut/diploma-terraform/7/stage/stage.tfplan\"" in "/atlantis/repos/run0ut/diploma-terraform/7/stage": exit status 1

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # yandex_compute_instance.control[0] has changed
~ resource "yandex_compute_instance" "control" {
        id                        = "fhmjth9v3ooh1vf3ghai"
      + labels                    = {}
        name                      = "diploma-control-stage-0"
        # (9 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # yandex_compute_instance.worker[0] has changed
~ resource "yandex_compute_instance" "worker" {
        id                        = "fhm4k0osfbetctu1nvek"
      + labels                    = {}
        name                      = "diploma-worker-stage-0"
        # (9 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.atlantis_statefulset will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "atlantis_statefulset" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            apiVersion: apps/v1
            kind: StatefulSet
            metadata:
              name: atlantis
            spec:
              serviceName: atlantis
              replicas: 1
              updateStrategy:
                type: RollingUpdate
                rollingUpdate:
                  partition: 0
              selector:
                matchLabels:
                  app: atlantis
              template:
                metadata:
                  labels:
                    app: atlantis
                spec:
            
                  securityContext:
                    fsGroup: 1000 # Atlantis group (1000) read/write access to volumes.
            
                  initContainers:
                  - name: volume-mount-hack
                    image: busybox
                    command:
                      - sh
                      - "-c"
                      - |
                        chown -R 100:1000 /atlantis
                        cp -r /home/atlantis_temp/. /home/atlantis/
                        chown -R 100:1000 /home/atlantis/
                        chmod 600 /home/atlantis/.ssh/*
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
                    - name: ssh
                      mountPath: /home/atlantis_temp/.ssh/id_rsa
                      subPath: id_rsa
                    - name: ssh-pub
                      mountPath: /home/atlantis_temp/.ssh/id_rsa.pub
                      subPath: id_rsa.pub
                    - name: terraformrc
                      mountPath: /home/atlantis_temp/.terraformrc
                      subPath: .terraformrc
                    - name: auto-tfvars
                      mountPath: /home/atlantis_temp/.auto.tfvars
                      subPath: .auto.tfvars
                    - name: key-json
                      mountPath: /home/atlantis_temp/key.json
                      subPath: key.json
                    - name: server-config
                      mountPath: /home/atlantis_temp/server.yaml
                      subPath: server.yaml
            
                  containers:
                  - name: atlantis
                    image: ghcr.io/runatlantis/atlantis:v0.20.1
                    # command: ["sleep", "360000"]
                    command: ["docker-entrypoint.sh"] 
                    args: 
                      - "server"
                      - "--atlantis-url=http://${atlantis_ip}:30141/"
                      - "--var-file-allowlist=/home/atlantis"
                      - "--tf-download-url=https://terraform-mirror.yandexcloud.net/"
                      - "--repo-config=/home/atlantis/server.yaml"
                      - "--enable-diff-markdown-format"
                    env:
                    - name: ATLANTIS_REPO_ALLOWLIST
                      value: github.com/run0ut/diploma-terraform # 2. Replace this with your own repo allowlist.
                    ### GitHub Config ###
                    - name: ATLANTIS_GH_USER
                      value: run0ut # 3. If you're using GitHub replace <YOUR_GITHUB_USER> with the username of your Atlantis GitHub user without the `@`.
                    - name: ATLANTIS_GH_TOKEN
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: token
                    - name: ATLANTIS_GH_WEBHOOK_SECRET
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: webhook-secret
                    ### End GitHub Config ###
                    - name: ATLANTIS_DATA_DIR
                      value: /atlantis
                    - name: ATLANTIS_PORT
                      value: "4141" # Kubernetes sets an ATLANTIS_PORT variable so we need to override.
            
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
            
                    ports:
                    - name: atlantis
                      containerPort: 4141
            
                    resources:
                      requests:
                        memory: 256Mi
                        cpu: 100m
                      limits:
                        memory: 256Mi
                        cpu: 100m
            
                  volumes:
                  - name: atlantis-home
                    emptyDir: { }
                  - name: atlantis-data
                    persistentVolumeClaim:
                      claimName: atlantis-data
                  - name: ssh
                    configMap:
                      name: atlantis-files
                      items: 
                      - key: ssh
                        path: id_rsa
                  - name: ssh-pub
                    configMap:
                      name: atlantis-files
                      items:
                      - key: ssh-pub
                        path: id_rsa.pub
                  - name: terraformrc
                    configMap:
                      name: atlantis-files
                      items:
                      - key: terraformrc
                        path: .terraformrc
                  - name: auto-tfvars
                    configMap:
                      name: atlantis-files
                      items:
                      - key: auto-tfvars
                        path: .auto.tfvars
                  - name: key-json
                    configMap:
                      name: atlantis-files
                      items:
                      - key: key-json
                        path: key.json
                  - name: server-config
                    configMap:
                      name: atlantis-files
                      items:
                      - key: server-config
                        path: server.yaml
        EOT
      + vars     = {
          + "atlantis_ip" = "178.154.221.203"
        }
    }

  # data.template_file.inventory will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "inventory" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [all]
            ${connection_strings_master}
            ${connection_strings_node}
            
            [kube_control_plane]
            ${list_master}
            
            [kube_node]
            ${list_node}
            
            [etcd]
            ${list_master}
            
            [k8s_cluster:children]
            kube_node
            kube_control_plane
        EOT
      + vars     = {
          + "connection_strings_master" = "diploma-control-stage-0 ansible_host=178.154.221.203 ansible_user=ubuntu"
          + "connection_strings_node"   = "diploma-worker-stage-0 ansible_host=178.154.222.48 ansible_user=ubuntu"
          + "list_master"               = "diploma-control-stage-0"
          + "list_node"                 = "diploma-worker-stage-0"
        }
    }

  # data.template_file.kubectl will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "kubectl" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            ---
            - name: Get kuber credentials
              hosts: diploma-control-${workspace}-0
              become: yes
              gather_facts: yes
              tasks:
                - name: Save host to var
                  set_fact:
                    kube_control_node: "{{ ansible_host }}"
                - name: Print fact
                  debug:
                    var: kube_control_node
            
                - name: Duplicate folder kube
                  copy:
                    src: /etc/kubernetes/admin.conf
                    dest: /etc/kubernetes/admin_export.conf
                    remote_src: yes
                    mode: 0755
            
                - name: Set Kube IP in config
                  replace:
                    path: /etc/kubernetes/admin_export.conf
                    regexp: "server: https://[0-9.]*:"
                    replace: "server: https://{{ kube_control_node }}:"
                - name: Fetch kube config
                  synchronize:
                    src: /etc/kubernetes/admin_export.conf
                    dest: ../kubeconfig/config-${workspace}
                    delete: yes
                    recursive: yes
                    owner: no
                    group: no
                    mode: pull
        EOT
      + vars     = {
          + "workspace" = "stage"
        }
    }

  # data.template_file.supplementary_addresses_in_ssl_keys will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "supplementary_addresses_in_ssl_keys" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            ---
            - name: Allow access by public IP
              hosts: localhost
              become: no
              gather_facts: no
              tasks:
                  - name: Configure option in k8s-cluster.yml
                    replace:
                      path: ../kubespray/inventory/diplomacluster/group_vars/k8s_cluster/k8s-cluster.yml
                      regexp: '^.*supplementary_addresses_in_ssl_keys:.*'
                      replace: "supplementary_addresses_in_ssl_keys: [127.0.0.1, {{ hostvars[\"diploma-control-${workspace}-0\"][\"ansible_host\"] }}]"
        EOT
      + vars     = {
          + "workspace" = "stage"
        }
    }

  # null_resource.app will be created
+ resource "null_resource" "app" {
      + id       = (known after apply)
      + triggers = {
          + "cluster_instance_ids" = "fhmjth9v3ooh1vf3ghai,fhm4k0osfbetctu1nvek"
        }
    }

  # null_resource.folder will be created
+ resource "null_resource" "folder" {
      + id = (known after apply)
    }

  # null_resource.grafana_public will be created
+ resource "null_resource" "grafana_public" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.inventories will be created
+ resource "null_resource" "inventories" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.kube_prometheus will be created
+ resource "null_resource" "kube_prometheus" {
      + id       = (known after apply)
      + triggers = {
          + "cluster_instance_ids" = "fhmjth9v3ooh1vf3ghai,fhm4k0osfbetctu1nvek"
        }
    }

  # null_resource.kubectl will be created
+ resource "null_resource" "kubectl" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.kubectl_playbook will be created
+ resource "null_resource" "kubectl_playbook" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.kubespray will be created
+ resource "null_resource" "kubespray" {
      + id       = (known after apply)
      + triggers = {
          + "cluster_instance_ids" = "fhmjth9v3ooh1vf3ghai,fhm4k0osfbetctu1nvek"
        }
    }

  # null_resource.public_access will be created
+ resource "null_resource" "public_access" {
      + id = (known after apply)
    }

  # null_resource.requirements is tainted, so must be replaced
-/+ resource "null_resource" "requirements" {
      ~ id = "2751156789912457439" -> (known after apply)
    }

  # null_resource.supplementary_addresses_in_ssl_keys_playbook will be created
+ resource "null_resource" "supplementary_addresses_in_ssl_keys_playbook" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.wait will be created
+ resource "null_resource" "wait" {
      + id = (known after apply)
    }

Plan: 12 to add, 0 to change, 1 to destroy.


null_resource.requirements: Destroying... [id=2751156789912457439]
null_resource.requirements: Destruction complete after 0s
null_resource.requirements: Creating...
null_resource.requirements: Provisioning with 'local-exec'...
null_resource.requirements (local-exec): Executing: ["/bin/sh" "-c" "pip3 install -r kubespray/requirements.txt"]
null_resource.requirements: Still creating... [10s elapsed]
null_resource.requirements: Still creating... [20s elapsed]
null_resource.requirements: Still creating... [30s elapsed]
null_resource.requirements (local-exec): Defaulting to user installation because normal site-packages is not writeable
null_resource.requirements (local-exec): ERROR: Could not open requirements file: [Errno 2] No such file or directory: 'kubespray/requirements.txt'
╷
│ Error: local-exec provisioner error
│ 
│   with null_resource.requirements,
│   on 00-prepare.tf line 8, in resource "null_resource" "requirements":
│    8:   provisioner "local-exec" {
│ 
│ Error running command 'pip3 install -r kubespray/requirements.txt': exit
│ status 1. Output: Defaulting to user installation because normal
│ site-packages is not writeable
│ ERROR: Could not open requirements file: [Errno 2] No such file or
│ directory: 'kubespray/requirements.txt'
│ 
╵

```
</details>

